import dte2sajybsyg8ygfq2lf from "../../assets/images/APIimg/news/dte2sajybsyg8ygfq2lf.jpg";
import kvn6qcdqtsqvt4l1ukyb from "../../assets/images/APIimg/news/kvn6qcdqtsqvt4l1ukyb.jpg";
import usbfxn4oze0q20oogmck from "../../assets/images/APIimg/news/usbfxn4oze0q20oogmck.jpg";
import vgin0upnauqonrig7eqx from "../../assets/images/APIimg/news/vgin0upnauqonrig7eqx.jpg";
import yumjsiekco1edn7lccu0 from "../../assets/images/APIimg/news/yumjsiekco1edn7lccu0.jpg";

const result = [
    {
    "_id": "62a4701fa1e81e40c06d1952",
    "title": "انگولار چیست|مهدی اصغری|1401/3/22",
    "text": "اگر به طراحی سایت علاقه دارید یا به صورت مبتدی در حال یادگیری مبانی توسعه وب هستید، آشنایی با انواع فریم ورک در سطح ابتدایی و پیشرفته، در مسیر یادگیری برای شما مؤثر واقع می شود. فریم ورک در واقع نوعی چهارچوب است که طراحان سایت و توسعه دهندگان وب از آن برای طراحی سایت و وب اپلیکیشن از آن استفاده می کنند. angular چیست؟ یکی از این انواع فریم ورک است که با ویژگی ها و قابلیت های خود نقش مؤثری در پیشرفت برنامه نویسان و توسعه دهندگان برای طراحی وب داشته است. در این مطلب به معرفی این فریم ورک و ویژگی های آن می پردازیم.",
    "category": "article",
    "image": vgin0upnauqonrig7eqx,
    "__v": 0
    },
    {
    "_id": "6290b6155d9ef33fc4e2e760",
    "title": "تغییرات کنکور ۱۴۰۲ چیست؟|خودم|1401/3/19",
    "text": "رئیس سازمان سنجش آموزش کشور گفت:  سهم کنکور سراسری ۱۴۰۲ در پذیرش داوطلبان به ۶۰ درصد و سهم سوابق تحصیلی به ۴۰ درصد تاثیر قطعی رسید؛ همچنین در آزمون سال آینده دروس عمومی حذف شد و بر اساس مصوبه شورای عالی انقلاب فرهنگی، آزمون دروس اختصاصی دو بار در سال برگزار می‌شود.\n",
    "category": "news",
    "image": kvn6qcdqtsqvt4l1ukyb,
    "__v": 0
    },
    {
    "_id": "6290b7aa5d9ef33fc4e2e772",
    "title": "آنگولار ۹ از راه رسید|عباس بهبودی|1401/3/22",
    "text": " نسخه ی جدید انگولار 9 منتشر شد. در این نسخه تغییرات مختلفی در فریمورک انگولار، Angular Material و CLI ایجاد شده است. در این نسخه از کامپایلر Ivy به صورت کامل استفاده می شود و بهبودهایی در بخش تست کامپوننت ها نیز ایجاد شده است. این نسخه یکی از بزرگترین به روزرسانی های Angular در 3 سال اخیر می باشد.",
    "category": "news",
    "image": vgin0upnauqonrig7eqx,
    "__v": 0
    },
    {
    "_id": "6291a0e44809c450281b66dd",
    "title": "چگونه سایت وردپرسی را از هک مصون کنیم|عباس بهبودی|1401/3/22",
    "text": "وردپرس یک CMS (سیستم مدیریت محتوا) پرکاربرد است که بخش قابل توجهی از وب سایت‌های موجود را شامل می‌شود. متأسفانه، این مسأله مجرمان سایبری را نیز جذب می‌کند که از نقایص امنیتی این پلتفرم سواستفاده کنند.\n\nاین بدان معنا نیست که مکانیسم امنیتی وردپرس بی‌اثر است. همچنین ممکن است به دلیل عدم وجود اقدامات امنیتی از جانب کاربران مانند افزونه‌های قدیمی یا آلوده به بدافزار، مشکلات امنیتی رخ دهد. بنابراین، انجام اقدامات امنیتی قبل از اینکه وب سایت وردپرس شما هدف یک حمله مخرب قرار گیرد بسیار مهم است.\n\nاگرچه می‌توانید هنگام انتقال فایل‌ها با درک مقایسه TCP در مقابل UDP و انتخاب بهترین مورد برای امنیت وب، امنیت شبکه را حفظ کنید، برخی جزئیات ارزشمند و در عین حال کوچک ممکن است به شما در حفظ امنیت وب‌سایتتان در درازمدت کمک قابل توجهی کند.",
    "category": "news",
    "image": yumjsiekco1edn7lccu0,
    "__v": 0
    },
    {
    "_id": "629ee12366a0e724ac32eafc",
    "title": "تپسی وارد بازار سرمایه میشود|عباس بهبودی|1401/3/22",
    "text": "رکت پیشگامان فناوری و دانش آرامیس با نماد تپسی، اطلاعیه عرضه اولیه خود را منتشر کرد که طبق این اطلاعیه سه‌شنبه ۲۴ خردادماه این شرکت فعال در حوزه حمل‌ونقل هوشمند به‌عنوان نخستین استارتاپ ایرانی وارد بازار دوم فرابورس خواهد شد.\n\nطبق این اطلاعیه عرضه سهام به روش گشایش در نماد معاملاتی «تپسی۱» خواهد بود و تعداد کل سهام شرکت یک میلیارد و ۱۷۰ میلیون و ۵۲۸ هزار و ۸۰۰ سهم است. متعهد عرضه سهام‌داران حقیقی و حقوقی و مشاور عرضه، شرکت کارگزاری بانک تجارت است. از سوی دیگر شرکت تأمین سرمایه کاردان متعهد خرید و بازارگردان معرفی شده است.",
    "category": "news",
    "image": dte2sajybsyg8ygfq2lf,
    "__v": 0
    },
    {
    "_id": "62a4731ca1e81e40c06d1954",
    "title": "نسخه جدید انگولار|مهدی اصغری|1401/3/22",
    "text": " نسخه ی جدید انگولار 9 منتشر شد. در این نسخه تغییرات مختلفی در فریمورک انگولار، Angular Material و CLI ایجاد شده است. در این نسخه از کامپایلر Ivy به صورت کامل استفاده می شود و بهبودهایی در بخش تست کامپوننت ها نیز ایجاد شده است. این نسخه یکی از بزرگترین به روزرسانی های Angular در 3 سال اخیر می باشد.",
    "category": "article",
    "image": usbfxn4oze0q20oogmck,
    "__v": 0
    }
];

export const GetTopNewsAPI = () =>{
    return result;
}

export const GetTopNewsByIdAPI = (NewsId) => {
    const Data = result.find((e) => e._id === NewsId);
    return Data;
};
  